In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

from pandas_profiling import ProfileReport

pd.set_option('display.max_rows',10000)

In [2]:
df = pd.read_csv("validation.csv", low_memory=False, encoding="ISO-8859-1")

In [3]:
df.head()

,userId,movieId,rating,timestamp,title,genres
0,1,231,5.0,838983392,Dumb & Dumber (1994),Comedy
1,1,480,5.0,838983653,Jurassic Park (1993),Action|Adventure|Sci-Fi|Thriller
2,1,586,5.0,838984068,Home Alone (1990),Children|Comedy
3,2,151,3.0,868246450,Rob Roy (1995),Action|Drama|Romance|War
4,2,858,2.0,868245645,"Godfather, The (1972)",Crime|Drama

In [4]:
df.describe()

              userId        movieId         rating     timestamp
count  999999.000000  999999.000000  999999.000000  9.999990e+05
mean    35870.210534    4107.593440       3.512033  1.032520e+09
std     20586.163894    8904.973359       1.061202  1.159386e+08
min         1.000000       1.000000       0.500000  7.896520e+08
25%     18096.000000     648.000000       3.000000  9.466736e+08
50%     35768.000000    1827.000000       4.000000  1.035247e+09
75%     53621.000000    3624.000000       4.000000  1.126641e+09
max     71567.000000   65133.000000       5.000000  1.231131e+09

In [5]:
df2 = df.drop(['userId','timestamp','title'],axis=1)

In [6]:
df2.shape

(999999, 3)

In [7]:
df2.head()

   movieId  rating                            genres
0      231     5.0                            Comedy
1      480     5.0  Action|Adventure|Sci-Fi|Thriller
2      586     5.0                   Children|Comedy
3      151     3.0          Action|Drama|Romance|War
4      858     2.0                       Crime|Drama

In [8]:
df3 = df2.sort_values(by=['movieId'])

In [9]:
df3

        movieId  rating                                       genres
788778        1     4.5  Adventure|Animation|Children|Comedy|Fantasy
10330         1     5.0  Adventure|Animation|Children|Comedy|Fantasy
236958        1     3.5  Adventure|Animation|Children|Comedy|Fantasy
714566        1     3.0  Adventure|Animation|Children|Comedy|Fantasy
14777         1     3.0  Adventure|Animation|Children|Comedy|Fantasy
...         ...     ...                                          ...
92255     64997     3.0                                       Action
365453    64999     1.0                                       Action
441651    65088     2.5                    Adventure|Children|Comedy
763577    65088     1.0                    Adventure|Children|Comedy
340651    65133     4.0                                       Comedy

[999999 rows x 3 columns]

In [10]:
df3.reset_index(inplace=True)

In [11]:
df3

         index  movieId  rating                                       genres
0       788778        1     4.5  Adventure|Animation|Children|Comedy|Fantasy
1        10330        1     5.0  Adventure|Animation|Children|Comedy|Fantasy
2       236958        1     3.5  Adventure|Animation|Children|Comedy|Fantasy
3       714566        1     3.0  Adventure|Animation|Children|Comedy|Fantasy
4        14777        1     3.0  Adventure|Animation|Children|Comedy|Fantasy
...        ...      ...     ...                                          ...
999994   92255    64997     3.0                                       Action
999995  365453    64999     1.0                                       Action
999996  441651    65088     2.5                    Adventure|Children|Comedy
999997  763577    65088     1.0                    Adventure|Children|Comedy
999998  340651    65133     4.0                                       Comedy

[999999 rows x 4 columns]

In [12]:
df3 = df3.drop(['index'],axis=1)

In [13]:
df3

        movieId  rating                                       genres
0             1     4.5  Adventure|Animation|Children|Comedy|Fantasy
1             1     5.0  Adventure|Animation|Children|Comedy|Fantasy
2             1     3.5  Adventure|Animation|Children|Comedy|Fantasy
3             1     3.0  Adventure|Animation|Children|Comedy|Fantasy
4             1     3.0  Adventure|Animation|Children|Comedy|Fantasy
...         ...     ...                                          ...
999994    64997     3.0                                       Action
999995    64999     1.0                                       Action
999996    65088     2.5                    Adventure|Children|Comedy
999997    65088     1.0                    Adventure|Children|Comedy
999998    65133     4.0                                       Comedy

[999999 rows x 3 columns]

In [14]:
df3.groupby(by=['movieId','rating']).count()

                genres
movieId rating
1       0.5          5
        1.0         37
        1.5          6
        2.0         72
        2.5         47
...                ...
64997   3.5          1
64999   1.0          1
65088   1.0          1
        2.5          1
65133   4.0          1

[56959 rows x 1 columns]

In [15]:
df4 = df3.groupby(by=['movieId','rating']).count()

In [16]:
df4.head()

                genres
movieId rating
1       0.5          5
        1.0         37
        1.5          6
        2.0         72
        2.5         47

In [17]:
df4.columns

Index(['genres'], dtype='object')

In [18]:
df4.reset_index(inplace=True)

In [19]:
df4.columns

Index(['movieId', 'rating', 'genres'], dtype='object')

In [20]:
df4.head()

   movieId  rating  genres
0        1     0.5       5
1        1     1.0      37
2        1     1.5       6
3        1     2.0      72
4        1     2.5      47

In [21]:
df4.rename(columns={"genres":'Count'},inplace=True)

In [22]:
df4

       movieId  rating  Count
0            1     0.5      5
1            1     1.0     37
2            1     1.5      6
3            1     2.0     72
4            1     2.5     47
...        ...     ...    ...
56954    64997     3.5      1
56955    64999     1.0      1
56956    65088     1.0      1
56957    65088     2.5      1
56958    65133     4.0      1

[56959 rows x 3 columns]

In [23]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 56959 entries, 0 to 56958
Data columns (total 3 columns):
movieId    56959 non-null int64
rating     56959 non-null float64
Count      56959 non-null int64
dtypes: float64(1), int64(2)
memory usage: 1.3 MB

In [24]:
df4.rename(columns={"Count":'count'},inplace=True)

In [25]:
df4.head()

   movieId  rating  count
0        1     0.5      5
1        1     1.0     37
2        1     1.5      6
3        1     2.0     72
4        1     2.5     47

In [26]:
#Rearrange the columns
df4 = df4[['movieId','count','rating']]

In [27]:
df4.head()

   movieId  count  rating
0        1      5     0.5
1        1     37     1.0
2        1      6     1.5
3        1     72     2.0
4        1     47     2.5

In [28]:
#Save to csv
#df4.to_csv("testoriginal.csv",index=False)

In [29]:
#Drop rating as this is the target
df4.drop(['rating'],axis=1,inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4117: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [30]:
df4.head()

   movieId  count
0        1      5
1        1     37
2        1      6
3        1     72
4        1     47

In [31]:
#Save to csv
#df4.to_csv("test.csv",index=False)

In [32]:
profile = ProfileReport(df4,title='Pandas Profiling Report')

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:4238: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(**kwargs)

In [33]:
profile

Tab(children=(HTML(value='<div id="overview-content" class="row variable spacing">\n    <div class="row">\n   …